app/views/actors/_form.html.erb

    <div class="controls">
      <%= f.collection_select :sex_id, Sex.order(:title),:id,:title, :class => 'form-control' %>
---
SELECT "sexes".* FROM "sexes"   ORDER BY "sexes"."title" ASC

    <div class="controls">
      <%= f.collection_select :ethnicity_id, Ethnicity.order(:title),:id,:title, :class => 'form-control' %>
---
SELECT "ethnicities".* FROM "ethnicities"   ORDER BY "ethnicities"."title" ASC