app/controllers/actors_controller.rb

SELECT "actors".* FROM "actors"
---
  def index
    @actors = Actor.all

INSERT INTO "actors" ("age_max", "age_min", "city_of_residence", "created_at", "email", "expected_grad", "eye_color", "first_name", "hair_color", "last_name", "phone", "previous_experience", "reel", "sex_id", "skills", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @actor = Actor.new(actor_params)
    @actor.save

UPDATE "actors" SET "sex_id" = ?, "updated_at" = ? WHERE "actors"."id" = 0  [["sex_id", 2], ["updated_at", "2015-01-20 05:23:56.645440"]]
---
  def update
    @actor.update(actor_params)

DELETE FROM "actors" WHERE "actors"."id" = ?  [["id", 1]]
---
  def destroy
    @actor.destroy

SELECT  "actors".* FROM "actors"  WHERE "actors"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_actor
      @actor = Actor.find(params[:id])